{
    "navbar": {
        "logo": "<Dev />",
        "home": "Home",
        "skills": "Tech Stack",
        "experience": "Experience",
        "projects": "Projects",
        "contact": "Contact"
    },
    "home": {
        "greeting": "Hello, I'm",
        "name": "José Tebelán",
        "title": "Systems Engineer, Full Stack Developer and DevOps",
        "description": "Full Stack Developer (Python + TypeScript) with a focus on Backend and DevOps. I develop and maintain web and desktop applications, integrating APIs, databases, and cloud services. I work with Python, JavaScript/TypeScript, AWS, and Docker, aiming to create scalable, stable, and impactful solutions!",
        "projectsButton": "View Projects",
        "downloadCVButton": "Download CV"
    },
    "techStack": {
        "title": "Tech Stack",
        "description": "A set of technologies that I use in an integrated way to design, develop, and deploy modern web applications, prioritizing performance, maintainability, and scalability."
    },
    "experience": {
        "title": "Experience",
        "description": "Throughout my career, I have had the opportunity to work on various projects that have allowed me to develop and refine my skills as a Full Stack and DevOps developer. My experience ranges from developing web applications to implementing cloud solutions, always with a focus on efficiency, scalability, and code quality.",
        "items": [
            {
                "title": "Full Stack Developer",
                "company": "Ahau-x",
                "period": "Dec 2025 - Present",
                "description": "Development and maintenance of web and desktop applications focused on computer vision applied to agriculture, implementing new features and optimizing frontend and backend workflows through API integration, databases, and cloud services (AWS), prioritizing scalability, stability, and effective data visualization."
            },
            {
                "title": "Supervised Professional Practice – Electronics Technician",
                "company": "Asociación Ajb ' atz ' Enlace Quiché - NGO -",
                "period": "Jun 2018 - Dec 2018",
                "description": "Computer equipment repair and software maintenance with fault diagnosis and electronic risk mitigation, reducing hardware recurrences by 30% and recurring failures by 65%. Implementation of structured cabling maintenance under international standards, improving network stability by 20% and reducing latency by 15%."
            }
        ]
    },
    "projects": {
        "title": "Projects",
        "description": "Here are some of the projects I've worked on, showcasing my skills and experience in Full Stack development and DevOps. Each project highlights different technologies and solutions I've implemented to create impactful applications.",
        "techStack": "Technologies",
        "demo": "Demo",
        "viewAllProjects": "View All Projects",
        "items": [
            {
                "title": "CookBook App",
                "technologies": [
                    "Django",
                    "Vue.js",
                    "PostgreSQL"
                ],
                "description": "RecetarioWeb is a modern and robust full-stack web application designed to manage, share, and discover cooking recipes. The project combines a powerful backend developed with Django REST Framework and an interactive frontend built with Vue.js 3, offering a smooth and professional user experience.",
                "url": "cookbook-bice-eight.vercel.app"
            },
            {
                "title": "Blog Spots",
                "technologies": [
                    "Flask",
                    "PostgreSQL"
                ],
                "description": "Flask-BlogPosts is a modern web application for creating and managing blogs. It allows users to register, create posts with a rich text editor, manage profiles with avatars stored in the cloud, and search content within the blog.",
                "url": "blogposts-ivory.vercel.app"
            }
        ]
    }
}